Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Native database backup
sv: Inbyggd databasbackup

source: The recommended approach is to save a dump of the database using database-native tools such as :program:`pg_dump` or :program:`mysqldump`. It usually performs better than Django backup, and it restores complete tables with all their data.
sv: Det rekommenderade tillvÃ¤gagÃ¥ngssÃ¤ttet Ã¤r att spara en dump av databasen med hjÃ¤lp av databasens egna verktyg, sÃ¥som :program:`pg_dump` eller :program:`mysqldump`. Det fungerar vanligtvis bÃ¤ttre Ã¤n Djangos sÃ¤kerhetskopiering och Ã¥terstÃ¤ller kompletta tabeller med all data.

source: You can restore this backup in a newer Weblate release, it will perform all the necessary migrations when running in :wladmin:`migrate`. Please consult :doc:`upgrade` on more detailed info on how to upgrade between versions.
sv: Du kan Ã¥terstÃ¤lla denna sÃ¤kerhetskopia i en nyare version av Weblate, som kommer att utfÃ¶ra alla nÃ¶dvÃ¤ndiga migreringar nÃ¤r den kÃ¶rs i :wladmin:`migrate`. Se :doc:`upgrade` fÃ¶r mer detaljerad information om hur du uppgraderar mellan versioner.

source: Django database backup
sv: Django-databasbackup

source: Alternatively, you can back up your database using Django's :djadmin:`django:dumpdata` command. That way the backup is database agnostic and can be used in case you want to change the database backend.
sv: Alternativt kan du sÃ¤kerhetskopiera din databas med hjÃ¤lp av Djangos kommando :djadmin:`django:dumpdata`. PÃ¥ sÃ¥ sÃ¤tt Ã¤r sÃ¤kerhetskopian databasoberoende och kan anvÃ¤ndas om du vill byta databasbackend.

source: Prior to restoring the database you need to be running exactly the same Weblate version the backup was made on. This is necessary as the database structure does change between releases and you would end up corrupting the data in some way. After installing the same version, run all database migrations using :wladmin:`migrate`.
sv: Innan du Ã¥terstÃ¤ller databasen mÃ¥ste du kÃ¶ra exakt samma version av Weblate som sÃ¤kerhetskopian skapades pÃ¥. Detta Ã¤r nÃ¶dvÃ¤ndigt eftersom databasstrukturen fÃ¶rÃ¤ndras mellan olika versioner och du annars riskerar att skada data pÃ¥ nÃ¥got sÃ¤tt. Efter att ha installerat samma version kÃ¶r du alla databasmigreringar med :wladmin:`migrate`.

source: Afterwards some entries will already be created in the database and you will have them in the database backup as well. The recommended approach is to delete such entries manually using the management shell (see :ref:`invoke-manage`):
sv: EfterÃ¥t kommer vissa poster redan att ha skapats i databasen och du kommer ocksÃ¥ att ha dem i databasens sÃ¤kerhetskopia. Det rekommenderade tillvÃ¤gagÃ¥ngssÃ¤ttet Ã¤r att radera sÃ¥dana poster manuellt med hjÃ¤lp av administrationsskalet (se :ref:`invoke-manage`):

source: If you have enough backup space, simply back up the whole :setting:`DATA_DIR`. This is a safe bet even if it includes some files you don't want. The following sections describe what you should back up and what you can skip in detail.
sv: Om du har tillrÃ¤ckligt med utrymme fÃ¶r sÃ¤kerhetskopiering kan du helt enkelt sÃ¤kerhetskopiera hela :setting:`DATA_DIR`. Detta Ã¤r ett sÃ¤kert val Ã¤ven om det innehÃ¥ller nÃ¥gra filer som du inte vill ha. I fÃ¶ljande avsnitt beskrivs i detalj vad du bÃ¶r sÃ¤kerhetskopiera och vad du kan hoppa Ã¶ver.

source: Dumped data for backups
sv: Dumpade data fÃ¶r sÃ¤kerhetskopior

source: The environment dump was added as :file:`environment.yml` to help in restoring in the Docker environments.
sv: MiljÃ¶dumpen lades till som :file:`environment.yml` fÃ¶r att underlÃ¤tta Ã¥terstÃ¤llningen i Docker-miljÃ¶erna.

source: Stored in :setting:`DATA_DIR` ``/backups``.
sv: Lagras i :setting:`DATA_DIR` ``/backups``.

source: Weblate dumps various data here, and you can include these files for more complete backups. The files are updated daily (requires a running Celery beats server, see :ref:`celery`). Currently, this includes:
sv: Weblate sparar olika data hÃ¤r, och du kan inkludera dessa filer fÃ¶r mer kompletta sÃ¤kerhetskopior. Filerna uppdateras dagligen (krÃ¤ver en kÃ¶rande Celery beats-server, se :ref:`celery`). FÃ¶r nÃ¤rvarande inkluderar detta:

source: Weblate settings as :file:`settings.py` (there is also expanded version in :file:`settings-expanded.py`).
sv: Weblate-instÃ¤llningar som :file:`settings.py` (det finns ocksÃ¥ en utÃ¶kad version i :file:`settings-expanded.py`).

source: PostgreSQL database backup as :file:`database.sql`.
sv: PostgreSQL-databasbackup som :file:`database.sql`.

source: Environment dump as :file:`environment.yml`.
sv: MiljÃ¶ dump som :file:`environment.yml`.

source: The database backups are saved as plain text by default, but they can also be compressed or entirely skipped using :setting:`DATABASE_BACKUP`.
sv: Databasbackuperna sparas som vanlig text som standard, men de kan ocksÃ¥ komprimeras eller helt hoppas Ã¶ver med hjÃ¤lp av :setting:`DATABASE_BACKUP`.

source: To restore the database backup, load it using database tools, for example:
sv: FÃ¶r att Ã¥terstÃ¤lla databasbackupen, ladda den med hjÃ¤lp av databasverktyg, till exempel:

source: Version control repositories
sv: VersionskontrollfÃ¶rvar

source: Stored in :setting:`DATA_DIR` ``/vcs``.
sv: Lagras i :setting:`DATA_DIR` ``/vcs``.

source: The version control repositories contain a copy of your upstream repositories with Weblate changes. If you have :ref:`component-push_on_commit` enabled for all your translation components, all Weblate changes are included upstream. No need to back up the repositories on the Weblate side as they can be cloned again from the upstream location with no data loss.
sv: VersionskontrollfÃ¶rvaren innehÃ¥ller en kopia av dina uppstrÃ¶msfÃ¶rvar med Weblate-Ã¤ndringar. Om du har :ref:`component-push_on_commit` aktiverat fÃ¶r alla dina Ã¶versÃ¤ttningskomponenter inkluderas alla Weblate-Ã¤ndringar uppstrÃ¶ms. Det finns inget behov av att sÃ¤kerhetskopiera fÃ¶rvaren pÃ¥ Weblate-sidan eftersom de kan klonas igen frÃ¥n uppstrÃ¶msplatsen utan datafÃ¶rlust.

source: SSH and GPG keys
sv: SSH- och GPG-nycklar

source: Stored in :setting:`DATA_DIR` ``/ssh`` and :setting:`DATA_DIR` ``/home``.
sv: Lagras i :setting:`DATA_DIR` ``/ssh`` och :setting:`DATA_DIR` ``/home``.

source: If you are using SSH or GPG keys generated by Weblate, you should back up these locations. Otherwise you will lose the private keys and you will have to regenerate new ones.
sv: Om du anvÃ¤nder SSH- eller GPG-nycklar som genererats av Weblate bÃ¶r du sÃ¤kerhetskopiera dessa platser. Annars fÃ¶rlorar du de privata nycklarna och mÃ¥ste generera nya.

source: User uploaded files
sv: AnvÃ¤ndaruppladdade filer

source: Stored in :setting:`DATA_DIR` ``/media``.
sv: Lagras i :setting:`DATA_DIR` ``/media``.

source: You should back up all user uploaded files (e.g. :ref:`screenshots`).
sv: Du bÃ¶r sÃ¤kerhetskopiera alla filer som anvÃ¤ndare har laddat upp (t.ex. :ref:`screenshots`).

source: Celery tasks
sv: Selleriuppgifter

source: The Celery task queue might contain some info, but is usually not needed for a backup. At most you will lose updates not yet been processed to translation memory. It is recommended to perform the fulltext or repository update upon restoration anyhow, so there is no problem in losing these.
sv: Celery-uppgiftskÃ¶n kan innehÃ¥lla viss information, men behÃ¶vs vanligtvis inte fÃ¶r en sÃ¤kerhetskopiering. Du fÃ¶rlorar hÃ¶gst uppdateringar som Ã¤nnu inte har bearbetats till Ã¶versÃ¤ttningsminnet. Det rekommenderas Ã¤ndÃ¥ att utfÃ¶ra fulltext- eller arkivuppdateringen vid Ã¥terstÃ¤llningen, sÃ¥ det Ã¤r inget problem att fÃ¶rlora dessa.

source: Command-line for manual backup
sv: Kommandorad fÃ¶r manuell sÃ¤kerhetskopiering

source: Using a cron job, you can set up a Bash command to be executed on a daily basis, for example:
sv: Med hjÃ¤lp av ett cron-jobb kan du stÃ¤lla in ett Bash-kommando som ska kÃ¶ras dagligen, till exempel:

source: You can adjust the list of folders and files to your needs. To avoid saving the translation memory (in backups folder), you can use:
sv: Du kan anpassa listan Ã¶ver mappar och filer efter dina behov. FÃ¶r att undvika att spara Ã¶versÃ¤ttningsminnet (i mappen fÃ¶r sÃ¤kerhetskopior) kan du anvÃ¤nda:

source: Restoring manual backup
sv: Ã terstÃ¤lla manuell sÃ¤kerhetskopia

source: Restore all data you have backed up.
sv: Ã terstÃ¤ll alla data som du har sÃ¤kerhetskopierat.

source: Update all repositories using :wladmin:`updategit`.
sv: Uppdatera alla arkiv med :wladmin:`updategit`.

source: Moving a Weblate installation
sv: Flytta en Weblate-installation

source: Relocate your installation to a different system by following the backing up and restoration instructions above.
sv: Flytta din installation till ett annat system genom att fÃ¶lja instruktionerna fÃ¶r sÃ¤kerhetskopiering och Ã¥terstÃ¤llning ovan.

source: `Upgrading from Python 2 to Python 3 in the Weblate 3.11.1 documentation <https://docs.weblate.org/en/weblate-3.11.1/admin/upgrade.html#upgrading-from-python-2-to-python-3>`_
sv: `Uppgradering frÃ¥n Python 2 till Python 3 i Weblate 3.11.1-dokumentationen <https://docs.weblate.org/en/weblate-3.11.1/admin/upgrade.html#upgrading-from-python-2-to-python-3>`_

source: Checks and fixups
sv: Kontroller och korrigeringar

source: Custom automatic fixups
sv: Anpassade automatiska korrigeringar

source: You can also implement your own automatic fixup in addition to the standard ones and include them in :setting:`AUTOFIX_LIST`.
sv: Du kan ocksÃ¥ implementera egna automatiska korrigeringar utÃ¶ver standardkorrigeringarna och inkludera dem i :setting:`AUTOFIX_LIST`.

source: The automatic fixes are powerful, but can also cause damage; be careful when writing one.
sv: De automatiska korrigeringarna Ã¤r kraftfulla, men kan ocksÃ¥ orsaka skador. Var fÃ¶rsiktig nÃ¤r du skriver en.

source: For example, the following automatic fixup would replace every occurrence of the string ``foo`` in a translation with ``bar``:
sv: Till exempel skulle fÃ¶ljande automatiska korrigering ersÃ¤tta varje fÃ¶rekomst av strÃ¤ngen ``foo`` i en Ã¶versÃ¤ttning med ``bar``:

source: To install custom checks, provide a fully-qualified path to the Python class in the :setting:`AUTOFIX_LIST`, see :ref:`custom-check-modules`.
sv: FÃ¶r att installera anpassade kontroller, ange en fullstÃ¤ndig sÃ¶kvÃ¤g till Python-klassen i :setting:`AUTOFIX_LIST`, se :ref:`custom-check-modules`.

source: Customizing behavior using flags
sv: Anpassa beteende med hjÃ¤lp av flaggor

source: You can fine-tune Weblate's behavior by using flags. The flags provide visual feedback to the translators and help them to improve their translation. The flags are merged from following sources:
sv: Du kan finjustera Weblates beteende med hjÃ¤lp av flaggor. Flaggorna ger Ã¶versÃ¤ttarna visuell feedback och hjÃ¤lper dem att fÃ¶rbÃ¤ttra sina Ã¶versÃ¤ttningar. Flaggorna sammanfÃ¶rs frÃ¥n fÃ¶ljande kÃ¤llor:

source: Source string additional flags:
sv: KÃ¤llstrÃ¤ngens ytterligare flaggor:

source: :ref:`additional` describes manual editing.
sv: :ref:`additional` beskriver manuell redigering.

source: :ref:`bulk-edit` can be used to apply flags in batch.
sv: :ref:`bulk-edit` kan anvÃ¤ndas fÃ¶r att tillÃ¤mpa flera flaggor.

source: :ref:`addon-weblate.flags.bulk` add-on can apply flags automatically.
sv: :ref:`addon-weblate.flags.bulk`-tillÃ¤gget kan tillÃ¤mpa flaggor automatiskt.

source: Per-string flags extracted from the file format, see :ref:`formats`.
sv: Flaggor per strÃ¤ng extraherade frÃ¥n filformatet, se :ref:`formats`.

source: Translation flags (currently only ``read-only`` flag for bilingual source string).
sv: ÃversÃ¤ttningsflaggor (fÃ¶r nÃ¤rvarande endast flaggan ``skrivskyddad`` fÃ¶r tvÃ¥sprÃ¥kiga kÃ¤llstrÃ¤ngar).

source: File-format specific flags.
sv: Filformatsspecifika flaggor.

source: The flags are comma-separated; if they have parameters, they are separated with colon. You can use quotes to include whitespaces or special characters in the string. For example:
sv: Flaggorna Ã¤r separerade med kommatecken; om de har parametrar separeras de med kolon. Du kan anvÃ¤nda citattecken fÃ¶r att inkludera blanksteg eller specialtecken i strÃ¤ngen. Till exempel:

source: Both single and double quotes are accepted, special characters are being escaped using backslash:
sv: BÃ¥de enkla och dubbla citattecken accepteras, specialtecken undviks med hjÃ¤lp av backslash:

source: To verify that translators do not change the heading of a Markdown document. A failing check will be triggered if the string ``### Index`` is translated as ``# Indice``.
sv: FÃ¶r att verifiera att Ã¶versÃ¤ttare inte Ã¤ndrar rubriken i ett Markdown-dokument. En felaktig kontroll utlÃ¶ses om strÃ¤ngen ``### Index`` Ã¶versÃ¤tts till ``# Indice``.

source: To ensure that internal links are not being translated (i.e. `[test](../checks)` does not become `[test](../chequeos)`.
sv: FÃ¶r att sÃ¤kerstÃ¤lla att interna lÃ¤nkar inte Ã¶versÃ¤tts (dvs. att `[test](../checks)` inte blir `[test](../chequeos)`.

source: The flags defined on a higher level can be discarded using the ``discard:NAME`` syntax. For example, if a component is configured to ``safe-html``, you can add ``discard:safe-html`` to the string flags to skip it for this particular string.
sv: Flaggorna som definieras pÃ¥ en hÃ¶gre nivÃ¥ kan kasseras med hjÃ¤lp av syntaxen ``discard:NAME``. Om en komponent till exempel Ã¤r konfigurerad till ``safe-html`` kan du lÃ¤gga till ``discard:safe-html`` till strÃ¤ngflaggorna fÃ¶r att hoppa Ã¶ver den fÃ¶r just denna strÃ¤ng.

source: Here is a list of flags currently accepted:
sv: HÃ¤r Ã¤r en lista Ã¶ver flaggor som fÃ¶r nÃ¤rvarande accepteras:

source: Treat a text as an reStructuredText document, affects :ref:`check-same`. Turns on :ref:`check-rst-syntax` and :ref:`check-rst-references`.
sv: Behandla en text som ett reStructuredText-dokument, pÃ¥verkar :ref:`check-same`. Aktiverar :ref:`check-rst-syntax` och :ref:`check-rst-references`.

source: Treat a text as an Bulletin Board Code (BBCode) document, affects :ref:`check-same`.
sv: Behandla en text som ett BBCode-dokument (Bulletin Board Code), pÃ¥verkar :ref:`check-same`.

# Uses DOS end-of-line markers instead of Unix ones (`` `` instead of `` ``).
source: Uses DOS end-of-line markers instead of Unix ones (``\r\n`` instead of ``\n``).
sv: AnvÃ¤nder DOS-radslutmarkÃ¶rer istÃ¤llet fÃ¶r Unix-markÃ¶rer (``\r\n`` istÃ¤llet fÃ¶r ``\n``).

source: The string is read-only and should not be edited in Weblate, see :ref:`read-only-strings`.
sv: StrÃ¤ngen Ã¤r skrivskyddad och bÃ¶r inte redigeras i Weblate, se :ref:`read-only-strings`.

source: Used in :ref:`glossary`. Copies the string into all glossary languages so it can be used consistently in all translations. Also useful in combination with ``read-only``, for example in product names.
sv: AnvÃ¤nds i :ref:`glossary`. Kopierar strÃ¤ngen till alla sprÃ¥k i ordlistan sÃ¥ att den kan anvÃ¤ndas konsekvent i alla Ã¶versÃ¤ttningar. AnvÃ¤ndbar Ã¤ven i kombination med ``read-only``, till exempel i produktnamn.

source: Priority of the string. Higher priority strings are presented first for translation. The default priority is 100, the higher priority a string has, the earlier it is offered for translation.
sv: StrÃ¤ngens prioritet. StrÃ¤ngar med hÃ¶gre prioritet visas fÃ¶rst fÃ¶r Ã¶versÃ¤ttning. Standardprioriteten Ã¤r 100. Ju hÃ¶gre prioritet en strÃ¤ng har, desto tidigare erbjuds den fÃ¶r Ã¶versÃ¤ttning.

source: Limit the maximal length for a string to N characters, see :ref:`check-max-length`.
sv: BegrÃ¤nsa den maximala lÃ¤ngden fÃ¶r en strÃ¤ng till N tecken, se :ref:`check-max-length`.

source: Treat text as XML document, affects :ref:`check-xml-invalid` and :ref:`check-xml-tags`.
sv: Behandla text som XML-dokument, pÃ¥verkar :ref:`check-xml-invalid` och :ref:`check-xml-tags`.

source: Define font-family for rendering checks, see :ref:`fonts`.
sv: Definiera teckensnittsfamilj fÃ¶r renderingskontroller, se :ref:`fonts`.

source: Define font-weight for rendering checks, see :ref:`fonts`.
sv: Definiera teckensnittsvikt fÃ¶r renderingskontroller, se :ref:`fonts`.

source: Define font-size for rendering checks, see :ref:`fonts`.
sv: Definiera teckenstorlek fÃ¶r renderingskontroller, se :ref:`fonts`.

source: Define letter spacing for rendering checks, see :ref:`fonts`.
sv: Definiera teckenavstÃ¥nd fÃ¶r renderingkontroller, se :ref:`fonts`.

source: Define flags for customizing the behavior of the :ref:`check-icu-message-format` quality check.
sv: Definiera flaggor fÃ¶r att anpassa beteendet fÃ¶r kvalitetskontrollen :ref:`check-icu-message-format`.

source: Set a required prefix for XML tags for the :ref:`check-icu-message-format` quality check.
sv: Ange ett obligatoriskt prefix fÃ¶r XML-taggar fÃ¶r kvalitetskontrollen :ref:`check-icu-message-format`.

source: Placeholder strings expected in translation, see :ref:`check-placeholders`.
sv: PlatshÃ¥llarstrÃ¤ngar som fÃ¶rvÃ¤ntas i Ã¶versÃ¤ttningen, se :ref:`check-placeholders`.

source: Replacements to perform when checking resulting text parameters (for example in :ref:`check-max-size` or :ref:`check-max-length`). The typical use case for this is to expand placeables to ensure that the text fits even with long values, for example: ``replacements:%s:"John Doe"``.
sv: ErsÃ¤ttningar som ska utfÃ¶ras vid kontroll av resulterande textparametrar (till exempel i :ref:`check-max-size` eller :ref:`check-max-length`). Det vanligaste anvÃ¤ndningsomrÃ¥det fÃ¶r detta Ã¤r att expandera placerbara objekt fÃ¶r att sÃ¤kerstÃ¤lla att texten passar Ã¤ven med lÃ¥nga vÃ¤rden, till exempel: ``ersÃ¤ttningar:%s:"John Doe"``.

source: Mark this string as a variant of string with matching source. See :ref:`variants`.
sv: Markera denna strÃ¤ng som en variant av strÃ¤ngen med matchande kÃ¤lla. Se :ref:`variants`.

source: Regular expression to match translation, see :ref:`check-regex`.
sv: ReguljÃ¤ra uttryck fÃ¶r att matcha Ã¶versÃ¤ttning, se :ref:`check-regex`.

source: Discards flag defined on a higher level.
sv: Kasserar flaggan som definierats pÃ¥ en hÃ¶gre nivÃ¥.

source: Indicates forbidden translation in a glossary, see :ref:`glossary-forbidden`.
sv: Indikerar fÃ¶rbjuden Ã¶versÃ¤ttning i en ordlista, se :ref:`glossary-forbidden`.

source: Make the :ref:`check-same` avoid using the built-in words exceptions.
sv: GÃ¶r sÃ¥ att :ref:`check-same` undviker att anvÃ¤nda de inbyggda ordundantagen.

source: Make format checks enforce using format even for plural forms with a single value, see :ref:`check-formats`.
sv: GÃ¶r formatkontroller obligatoriska Ã¤ven fÃ¶r pluralformer med ett enda vÃ¤rde, se :ref:`check-formats`.

source: Enable the :ref:`check-check-glossary` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-check-glossary`.

source: Enable the :ref:`check-angularjs-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-angularjs-format`.

source: Enable the :ref:`check-c-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-c-format`.

source: Enable the :ref:`check-c-sharp-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-c-sharp-format`.

source: Enable the :ref:`check-es-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-es-format`.

source: Enable the :ref:`check-i18next-interpolation` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-i18next-interpolation`.

source: Enable the :ref:`check-icu-message-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-icu-message-format`.

source: Enable the :ref:`check-java-printf-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-java-printf-format`.

source: Enable the :ref:`check-java-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-java-format`.

source: Enable the :ref:`check-javascript-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-javascript-format`.

source: Enable the :ref:`check-lua-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-lua-format`.

source: Enable the :ref:`check-object-pascal-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-object-pascal-format`.

source: Enable the :ref:`check-percent-placeholders` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-percent-placeholders`.

source: Enable the :ref:`check-perl-brace-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-perl-brace-format`.

source: Enable the :ref:`check-perl-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-perl-format`.

source: Enable the :ref:`check-php-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-php-format`.

source: Enable the :ref:`check-python-brace-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-python-brace-format`.

source: Enable the :ref:`check-python-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-python-format`.

source: Enable the :ref:`check-qt-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-qt-format`.

source: Enable the :ref:`check-qt-plural-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-qt-plural-format`.

source: Enable the :ref:`check-ruby-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-ruby-format`.

source: Enable the :ref:`check-scheme-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-scheme-format`.

source: Enable the :ref:`check-vue-format` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-vue-format`.

source: Treat text as a Markdown document, and provide Markdown syntax highlighting on the translation text area. Enables :ref:`check-md-link`, :ref:`check-md-reflink`, and :ref:`check-md-syntax` quality checks.
sv: Behandla texten som ett Markdown-dokument och tillhandahÃ¥ll Markdown-syntaxmarkering i Ã¶versÃ¤ttningstextomrÃ¥det. Aktiverar kvalitetskontroller :ref:`check-md-link`, :ref:`check-md-reflink` och :ref:`check-md-syntax`.

source: Adjust checks behavior to be case-insensitive. Currently affects only :ref:`check-placeholders` quality check.
sv: Justera kontrollernas beteende sÃ¥ att de inte skiljer mellan versaler och gemener. PÃ¥verkar fÃ¶r nÃ¤rvarande endast :ref:`check-placeholders` kvalitetskontroll.

source: Enable the :ref:`check-safe-html` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-safe-html`.

source: The string should consist of only a URL. Enable the :ref:`check-url` quality check.
sv: StrÃ¤ngen ska endast bestÃ¥ av en URL. Aktivera kvalitetskontrollen :ref:`check-url`.

source: Ignore all quality checks.
sv: Ignorera alla kvalitetskontroller.

source: Enable the :ref:`check-fluent-source-inner-html` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-fluent-source-inner-html`.

source: Enable the :ref:`check-fluent-source-syntax` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-fluent-source-syntax`.

source: Enable the :ref:`check-icu-message-format-syntax` quality check.
sv: Aktivera kvalitetskontrollen :ref:`check-icu-message-format-syntax`.

source: Skip the :ref:`check-bbcode` quality check.
sv: Hoppa Ã¶ver :ref:`check-bbcode` kvalitetskontrollen.

source: Skip the :ref:`check-duplicate` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-duplicate`.

source: Skip the :ref:`check-check-glossary` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-check-glossary`.

source: Skip the :ref:`check-double-space` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-double-space`.

source: Skip the :ref:`check-fluent-parts` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-fluent-parts`.

source: Skip the :ref:`check-fluent-references` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-fluent-references`.
